; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p11---int100n150-m25---int100c150---s220---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level12 level12)
(sum level0 level17 level17)
(sum level1 level2 level3)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level12 level13)
(sum level1 level17 level18)
(sum level2 level2 level4)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level12 level14)
(sum level2 level17 level19)
(sum level3 level2 level5)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level12 level15)
(sum level3 level17 level20)
(sum level4 level2 level6)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level12 level16)
(sum level4 level17 level21)
(sum level5 level2 level7)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level12 level17)
(sum level5 level17 level22)
(sum level6 level2 level8)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level12 level18)
(sum level6 level17 level23)
(sum level7 level2 level9)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level12 level19)
(sum level7 level17 level24)
(sum level8 level2 level10)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level12 level20)
(sum level8 level17 level25)
(sum level9 level2 level11)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level12 level21)
(sum level9 level17 level26)
(sum level10 level2 level12)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level12 level22)
(sum level10 level17 level27)
(sum level11 level2 level13)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level12 level23)
(sum level11 level17 level28)
(sum level12 level2 level14)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level12 level24)
(sum level12 level17 level29)
(sum level13 level2 level15)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level12 level25)
(sum level13 level17 level30)
(sum level14 level2 level16)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level12 level26)
(sum level14 level17 level31)
(sum level15 level2 level17)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level12 level27)
(sum level15 level17 level32)
(sum level16 level2 level18)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level12 level28)
(sum level16 level17 level33)
(sum level17 level2 level19)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level12 level29)
(sum level17 level17 level34)
(sum level18 level2 level20)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level12 level30)
(sum level18 level17 level35)
(sum level19 level2 level21)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level12 level31)
(sum level19 level17 level36)
(sum level20 level2 level22)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level12 level32)
(sum level20 level17 level37)
(sum level21 level2 level23)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level12 level33)
(sum level21 level17 level38)
(sum level22 level2 level24)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level12 level34)
(sum level22 level17 level39)
(sum level23 level2 level25)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level12 level35)
(sum level23 level17 level40)
(sum level24 level2 level26)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level12 level36)
(sum level24 level17 level41)
(sum level25 level2 level27)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level12 level37)
(sum level25 level17 level42)
(sum level26 level2 level28)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level12 level38)
(sum level26 level17 level43)
(sum level27 level2 level29)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level12 level39)
(sum level27 level17 level44)
(sum level28 level2 level30)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level12 level40)
(sum level28 level17 level45)
(sum level29 level2 level31)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level12 level41)
(sum level29 level17 level46)
(sum level30 level2 level32)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level12 level42)
(sum level30 level17 level47)
(sum level31 level2 level33)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level12 level43)
(sum level31 level17 level48)
(sum level32 level2 level34)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level12 level44)
(sum level32 level17 level49)
(sum level33 level2 level35)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level12 level45)
(sum level33 level17 level50)
(sum level34 level2 level36)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level12 level46)
(sum level34 level17 level51)
(sum level35 level2 level37)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level12 level47)
(sum level35 level17 level52)
(sum level36 level2 level38)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level12 level48)
(sum level36 level17 level53)
(sum level37 level2 level39)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level12 level49)
(sum level37 level17 level54)
(sum level38 level2 level40)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level12 level50)
(sum level38 level17 level55)
(sum level39 level2 level41)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level12 level51)
(sum level39 level17 level56)
(sum level40 level2 level42)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level12 level52)
(sum level40 level17 level57)
(sum level41 level2 level43)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level12 level53)
(sum level41 level17 level58)
(sum level42 level2 level44)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level12 level54)
(sum level42 level17 level59)
(sum level43 level2 level45)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level12 level55)
(sum level43 level17 level60)
(sum level44 level2 level46)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level12 level56)
(sum level44 level17 level61)
(sum level45 level2 level47)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level12 level57)
(sum level45 level17 level62)
(sum level46 level2 level48)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level12 level58)
(sum level46 level17 level63)
(sum level47 level2 level49)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level12 level59)
(sum level47 level17 level64)
(sum level48 level2 level50)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level12 level60)
(sum level48 level17 level65)
(sum level49 level2 level51)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level12 level61)
(sum level49 level17 level66)
(sum level50 level2 level52)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level12 level62)
(sum level50 level17 level67)
(sum level51 level2 level53)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level12 level63)
(sum level51 level17 level68)
(sum level52 level2 level54)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level12 level64)
(sum level52 level17 level69)
(sum level53 level2 level55)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level12 level65)
(sum level53 level17 level70)
(sum level54 level2 level56)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level12 level66)
(sum level54 level17 level71)
(sum level55 level2 level57)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level12 level67)
(sum level55 level17 level72)
(sum level56 level2 level58)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level12 level68)
(sum level56 level17 level73)
(sum level57 level2 level59)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level12 level69)
(sum level57 level17 level74)
(sum level58 level2 level60)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level12 level70)
(sum level58 level17 level75)
(sum level59 level2 level61)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level12 level71)
(sum level60 level2 level62)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level12 level72)
(sum level61 level2 level63)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level12 level73)
(sum level62 level2 level64)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level12 level74)
(sum level63 level2 level65)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level12 level75)
(sum level64 level2 level66)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level65 level2 level67)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level66 level2 level68)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level67 level2 level69)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level68 level2 level70)
(sum level68 level6 level74)
(sum level69 level2 level71)
(sum level69 level6 level75)
(sum level70 level2 level72)
(sum level71 level2 level73)
(sum level72 level2 level74)
(sum level73 level2 level75)

(connected l0 l1)
(fuelcost level2 l0 l1)
(connected l0 l2)
(fuelcost level17 l0 l2)
(connected l0 l3)
(fuelcost level8 l0 l3)
(connected l0 l4)
(fuelcost level12 l0 l4)
(connected l1 l0)
(fuelcost level2 l1 l0)
(connected l1 l4)
(fuelcost level6 l1 l4)
(connected l2 l0)
(fuelcost level17 l2 l0)
(connected l2 l4)
(fuelcost level9 l2 l4)
(connected l3 l0)
(fuelcost level8 l3 l0)
(connected l3 l4)
(fuelcost level8 l3 l4)
(connected l4 l0)
(fuelcost level12 l4 l0)
(connected l4 l1)
(fuelcost level6 l4 l1)
(connected l4 l2)
(fuelcost level9 l4 l2)
(connected l4 l3)
(fuelcost level8 l4 l3)

(at t0 l2)
(fuel t0 level75)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l0)
(at p3 l2)
(at p4 l2)
(at p5 l1)
(at p6 l2)
(at p7 l3)
(at p8 l2)
(at p9 l4)
(at p10 l0)
)

(:goal
(and
(at p0 l3)
(at p1 l2)
(at p2 l4)
(at p3 l1)
(at p4 l1)
(at p5 l0)
(at p6 l4)
(at p7 l1)
(at p8 l3)
(at p9 l0)
(at p10 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 0 of 11
2. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 11
3. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 11
4. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 11
5. (drive t0 l2 l0 level58 level17 level75)
   deleted: (at t0 l2) (fuel t0 level75)
   added: (at t0 l0) (fuel t0 level58)
   goals met: 0 of 11
6. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 11
7. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 11
8. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 11
9. (drive t0 l0 l3 level50 level8 level58)
   deleted: (at t0 l0) (fuel t0 level58)
   added: (at t0 l3) (fuel t0 level50)
   goals met: 0 of 11
10. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 1 of 11
11. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 2 of 11
12. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 3 of 11
13. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 3 of 11
14. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 3 of 11
15. (drive t0 l3 l4 level42 level8 level50)
   deleted: (at t0 l3) (fuel t0 level50)
   added: (at t0 l4) (fuel t0 level42)
   goals met: 3 of 11
16. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 4 of 11
17. (load p9 t0 l4)
   deleted: (at p9 l4)
   added: (in p9 t0)
   goals met: 4 of 11
18. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 5 of 11
19. (drive t0 l4 l1 level36 level6 level42)
   deleted: (at t0 l4) (fuel t0 level42)
   added: (at t0 l1) (fuel t0 level36)
   goals met: 5 of 11
20. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 5 of 11
21. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 6 of 11
22. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 7 of 11
23. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 8 of 11
24. (drive t0 l1 l0 level34 level2 level36)
   deleted: (at t0 l1) (fuel t0 level36)
   added: (at t0 l0) (fuel t0 level34)
   goals met: 8 of 11
25. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 9 of 11
26. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 10 of 11
27. (drive t0 l0 l2 level17 level17 level34)
   deleted: (at t0 l0) (fuel t0 level34)
   added: (at t0 l2) (fuel t0 level17)
   goals met: 10 of 11
28. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 11 of 11
